[
    {
      "query": "What are the fluorescent dyes being used in this image if any? Please specify which organelles are being stained and why?",
      "image_name": "NucleusLysosomeStain.png",
      "expected_answer": "The images being analyzed are fluorescent microscopy images using an array of DAPI, GFP, and rhodamine stains. The organelles in which each dye is used varies however usually, the DAPI stains the nucleus, GFP stains the mitochondria, ER, golgi, and/or lysosomes, and Rhodamine mainly looks at the mitochondria."
    },
    {
      "query": "Do the cells in these images seem healthy? If not, what is the process they could undergo and how would you know?",
      "image_name": "NucleusLysosomeStain.png",
      "expected_answer": "The cells in these images are not healthy and are beginning the formation of mitosis leading to apoptosis."
    },
    {
      "query": "Do you notice any morphological changes present in these images? If so what types and to what ratio are you able to compare puncta to filamentous networks?",
      "image_name": "NucleusLysosomeStain.png",
      "expected_answer": "The morphology changes that are to be present in these images will vary but there should be some puncta, or small spots, filamentous networks, large puncta, and fragmentation present. The ratio can be analyzed by how many cells it is able to detect and then form a ratio from here."
    },
    {
      "query": "These images have two pathways, one showing the basics of staining to certain organelles while others show invasion. What is being invaded into these cells? Which organelles are these morphology changes occurring in these images?",
      "image_name": "NucleusLysosomeStain.png",
      "expected_answer": "Virus/bacteria is being invaded into these cells. Morphology changes should be occurring in all organelles, in particular the lysosome in this image."
    },
    {
      "query": "How many of the cells in these images are undergoing cell death? Give me a number.",
      "image_name": "NucleusLysosomeStain.png",
      "expected_answer": "5"
    }
  ]
  